package com.Regexp_;

import java.util.regex.Matcher;
import java.util.regex.Pattern;

/**
 * 体现正则表达式案例
 */
public class regexp_ {
    public static void main(String[] args) {
        String  content= "20世纪90年代，硬件领域出现了单片式计算机系统，这种价格低廉的系统" +
                "一出现就立即引起了自动控制领域人员的注意，因为使用它可以大幅度提升消费类电子产品" +
                "（如电视机顶盒、面包烤箱、移动电话等）的智能化程度。Sun公司为了抢占市场先机，" +
                "在1991年成立了一个称为Green的项目小组，帕特里克、詹姆斯·高斯林、麦克·舍林丹和" +
                "其他几个工程师一起组成的工作小组在加利福尼亚州门洛帕克市沙丘路的一个小工作室里面" +
                "研究开发新技术，专攻计算机在家电产品上的嵌入式应用。" +
                "由于C++所具有的优势，该项目组的研究人员首先考虑采用C++来编写程序。但对于硬件资" +
                "源极其匮乏的单片式系统来说，C++程序过于复杂和庞大。另外由于消费电子产品所采用的嵌" +
                "入式处理器芯片的种类繁杂，如何让编写的程序跨平台运行也是个难题。为了解决困难，他们" +
                "首先着眼于语言的开发，假设了一种结构简单、符合嵌入式应用需要的硬件平台体系结构并为" +
                "其制定了相应的规范，其中就定义了这种硬件平台的二进制机器码指令系统（即后来成为“字节" +
                "码”的指令系统），以待语言开发成功后，能有半导体芯片生产商开发和生产这种硬件平台。" +
                "对于新语言的设计，Sun公司研发人员并没有开发一种全新的语言，" +
                "而是根据嵌入式软件的要求，对C++进行了改造，去除了留在C++的一些不太实用及影响安全" +
                "的成分，并结合嵌入式系统的实时性要求，开发了一种称为Oak的面向对象语言" +
                "由于在开发Oak语言时，尚且不存在运行字节码的硬件平台，所以为了在开发时可以对这种语" +
                "言进行实验研究，他们就在已有的硬件和软件平台基础上，按照自己所指定的规范，用软件建设" +
                "了一个运行平台，整个系统除了比C++更加简单之外，没有什么大的区别。1992年的夏天，当Oak" +
                "语言开发成功后，研究者们向硬件生产商进行演示了Green操作系统、Oak的程序设计语言、类库和" +
                "其硬件，以说服他们使用Oak语言生产硬件芯片，但是，硬件生产商并未对此产生极大的热情。因为" +
                "他们认为，在所有人对Oak语言还一无所知的情况下，就生产硬件产品的风险实在太大了，所以Oak" +
                "语言也就因为缺乏硬件的支持而无法进入市场，从而被搁置了下来。" +
                "1994年6、7月间，在经历了一场历时三天的讨论之后，团队决定再一次改变了努力的目标，这次" +
                "他们决定将该技术应用于万维网。他们认为随着Mosaic浏览器的到来，因特网正在向同样的高度互动" +
                "的远景演变，而这一远景正是他们在有线电视网中看到的。作为原型，帕特里克·诺顿写了一个小型万" +
                "维网浏览器WebRunner。 [8]" +
                "1995年，互联网的蓬勃发展给了Oak机会。业界为了使死板、单调的静态网页能够“灵活”起来，急需" +
                "一种软件技术来开发一种程序，这种程序可以通过网络传播并且能够跨平台运行。于是，世界各大IT" +
                "企业为此纷纷投入了大量的人力、物力和财力。这个时候，Sun公司想起了那个被搁置起来很久的Oak，并" +
                "且重新审视了那个用软件编写的试验平台，由于它是按照嵌入式系统硬件平台体系结构进行编写的，所以非" +
                "常小，特别适用于网络上的传输系统，而Oak也是一种精简的语言，程序非常小，适合在网络上传输。Sun" +
                "公司首先推出了可以嵌入网页并且可以随同网页在网络上传输的Applet（Applet是一种将小程序嵌入到网" +
                "页中进行执行的技术），并将Oak更名为Java。5月23日，Sun公司在Sun world会议上正式发布Java和" +
                "HotJava浏览器。IBM、Apple、DEC、Adobe、HP、Oracle、Netscape和微软等各大公司都纷纷停止了" +
                "自己的相关开发项目，竞相购买了Java使用许可证，并为自己的产品开发了相应的Java平台。 [9-10] " +
                "1996年1月，Sun公司发布了Java的第一个开发工具包（JDK 1.0），这是Java发展历程中的重要里程碑，" +
                "标志着Java成为一种独立的开发工具。9月，约8.3万个网页应用了Java技术来制作。10月，Sun公司发布了" +
                "Java平台的第一个即时（JIT）编译器。" +
                "1997年2月，JDK 1.1面世，在随后的3周时间里，达到了22万次的下载量。4月2日，Java One会议召开" +
                "，参会者逾一万人，创当时全球同类会议规模之纪录。9月，Java Developer Connection社区成员超过" +
                "10万。" +
                "1998年12月8日，第二代Java平台的企业版J2EE发布。1999年6月，Sun公司发布了第二代Java平台（" +
                "简称为Java2）的3个版本：J2ME（Java2 Micro Edition，Java2平台的微型版），应用于移动、" +
                "无线及有限资源的环境；J2SE（Java 2 Standard Edition，Java 2平台的标准版），应用于桌面" +
                "环境；J2EE（Java 2Enterprise Edition，Java 2平台的企业版），应用于基于Java的应用服务器。" +
                "Java 2平台的发布，是Java发展过程中最重要的一个里程碑，标志着Java的应用开始普及。" +
                "1999年4月27日，HotSpot虚拟机发布。HotSpot虚拟机发布时是作为JDK 1.2的附加程序提供的，后来它" +
                "成为了JDK 1.3及之后所有版本的Sun JDK的默认虚拟机 [11]  。" +
                "Java创始人之一：詹姆斯·高斯林" +
                "Java创始人之一：詹姆斯·高斯林" +
                "2000年5月，JDK1.3、JDK1.4和J2SE1.3相继发布，几周后其获得了Apple公司Mac OS X的工业" +
                "标准的支持。2001年9月24日，J2EE1.3发布。2002年2月26日，J2SE1.4发布。自此Java的计算" +
                "能力有了大幅提升，与J2SE1.3相比，其多了近62%的类和接口。在这些新特性当中，还提供了广泛的" +
                "XML支持、安全套接字（Socket）支持（通过SSL与TLS协议）、全新的I/OAPI、正则表达式、日志" +
                "与断言。2004年9月30日，J2SE1.5发布，成为Java语言发展史上的又一里程碑。为了表示该版本的" +
                "重要性，J2SE 1.5更名为Java SE 5.0（内部版本号1.5.0），代号为“Tiger”，Tiger包含了从" +
                "1996年发布1.0版本以来的最重大的更新，其中包括泛型支持、基本类型的自动装箱、改进的循环、" +
                "枚举类型、格式化I/O及可变参数。" ;
        //提取文中的英文   --传统方法 : 遍历比对ASCII码
        //----现使用正则表达式
        // 1.先创建一个 Pattern 对象 ， 模式对象, 可以理解成就是一个正则表达式对象
        //Pattern pattern = Pattern.compile("[a-zA-Z]+");
        //Pattern pattern = Pattern.compile("[0-9]+");
        Pattern pattern = Pattern.compile("([0-9]+)|([z-zA-Z]+)");
        //Pattern pattern = Pattern.compile("<a target=\"_blank\" title=\"(\\S*)\"");//取标题，
        // 2. 创建一个匹配器对象
        //理解 : 就是matcher 匹配按照 pattern (模式/样式), 到content 文本中去匹配，找到就返回 true 否则返回 false
        Matcher matcher = pattern.matcher(content);
        // 3. 循环匹配
        while(matcher.find()){
            //匹配内容，文本方法 m.group(0)中
            System.out.println("找到 ：" + matcher.group(0));
            //System.out.println("找到 ：" + matcher.group(1));   //取标题
        }
            //结论 : 正则表达式是提取文本的利器

    }


}
